Revit 2024 API
BoundaryValidation Class
 Curve loop validators.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public class BoundaryValidation : IDisposable
Visual Basic
Public Class BoundaryValidation _
	Implements IDisposable
Visual C++
public ref class BoundaryValidation : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BoundaryValidation
See Also
BoundaryValidation Members
Autodesk.Revit.DB Namespace